taskt/Core/Automation/Commands/UIAutomationGroup/IUIElementDescendantsSearchXPathProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementDescendantsSearchXPathProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromSomethingByXPathCommands" [ label="ADescendantsSearchUIElementsFromSomethingByXPathCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementDescendantsSearchXPathProperties" [ label="IUIElementDescendantsSearchXPathProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionFromSomethingByXPathCommands" [ label="AUIElementActionFromSomethingByXPathCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromUIElementByXPathCommands" [ label="ADescendantsSearchUIElementsFromUIElementByXPathCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromWindowHandleByXPathCommands" [ label="ADescendantsSearchUIElementsFromWindowHandleByXPathCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromWindowNameByXPathCommands" [ label="ADescendantsSearchUIElementsFromWindowNameByXPathCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionFromWindowSomethingByXPathCommands" [ label="AUIElementActionFromWindowSomethingByXPathCommands", style="dashed", ];
"taskt.Core.Automation.Commands.UIAutomationCheckUIElementExistsByXPathCommand" [ label="UIAutomationCheckUIElementExistsByXPathCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationWaitForUIElementToExistsByXPathCommand" [ label="UIAutomationWaitForUIElementToExistsByXPathCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementFromUIElementByXPathCommand" [ label="UIAutomationSearchUIElementFromUIElementByXPathCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementFromWindowHandleByXPathCommand" [ label="UIAutomationSearchUIElementFromWindowHandleByXPathCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementFromWindowNameByXPathCommand" [ label="UIAutomationSearchUIElementFromWindowNameByXPathCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowHandleCommand" [ label="UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowNameCommand" [ label="UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowNameCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromSomethingByXPathCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementDescendantsSearchXPathProperties";
"taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionFromSomethingByXPathCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.IUIElementDescendantsSearchXPathProperties";
"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromUIElementByXPathCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromSomethingByXPathCommands";
"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromWindowHandleByXPathCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromSomethingByXPathCommands";
"taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromWindowNameByXPathCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromSomethingByXPathCommands";
"taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionFromWindowSomethingByXPathCommands" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionFromSomethingByXPathCommands";
"taskt.Core.Automation.Commands.UIAutomationCheckUIElementExistsByXPathCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromUIElementByXPathCommands";
"taskt.Core.Automation.Commands.UIAutomationWaitForUIElementToExistsByXPathCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromUIElementByXPathCommands";
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementFromUIElementByXPathCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromUIElementByXPathCommands";
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementFromWindowHandleByXPathCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromWindowHandleByXPathCommands";
"taskt.Core.Automation.Commands.UIAutomationSearchUIElementFromWindowNameByXPathCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.ADescendantsSearchUIElementsFromWindowNameByXPathCommands";
"taskt.Core.Automation.Commands.UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionFromWindowSomethingByXPathCommands";
"taskt.Core.Automation.Commands.UIAutomationUIElementActionAfterSearchUIElementByXPathFromWindowNameCommand" -> "taskt.Core.Automation.Commands.UIAutomationGroup.AUIElementActionFromWindowSomethingByXPathCommands";
}
